Revit 2027 API
Noise.NoiseType Property
 The property labeled "Noise Type" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string NoiseType { get; }
Public Shared ReadOnly Property NoiseType As String
	Get
public:
static property String^ NoiseType {
	String^ get ();
}
static member NoiseType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "NoiseType".
See Also
Reference
Noise Class
Autodesk.Revit.DB.Visual Namespace